In [2]:
try:
    b=open('data.csv','x')
    b.close()
except:
    print('The file is already here')

The file is already here

In [4]:
import csv
csvfile = open('data.csv')
reader=csv.DictReader(csvfile)
for row in reader:
    print(row)

{'Name': 'Ram', 'Age': '25', 'Address': 'Kathmandu', 'Phone': '9854124536'}
{'Name': 'Shyam', 'Age': '29', 'Address': 'Pokhara', 'Phone': '9874561265'}
{'Name': 'Hari', 'Age': '24', 'Address': 'Butwal', 'Phone': '9842153678'}
{'Name': 'John', 'Age': '35', 'Address': 'Kapan', 'Phone': '981245785'}
{'Name': 'Rita', 'Age': '32', 'Address': 'Gulmi', 'Phone': '9865214578'}
{'Name': 'Sita', 'Age': '19', 'Address': 'Bara', 'Phone': '9865235447'}

In [3]:
import pandas as pd
df=pd.read_csv('data.csv')
# print(df)
df

    Name  Age    Address       Phone
0    Ram   25  Kathmandu  9854124536
1  Shyam   29    Pokhara  9874561265
2   Hari   24     Butwal  9842153678
3   John   35      Kapan   981245785
4   Rita   32      Gulmi  9865214578
5   Sita   19       Bara  9865235447

In [4]:
import pandas as pd
df=pd.read_csv('data.csv',nrows=3)   #it prints the number of rows specified
df

    Name  Age    Address       Phone
0    Ram   25  Kathmandu  9854124536
1  Shyam   29    Pokhara  9874561265
2   Hari   24     Butwal  9842153678

In [6]:
import pandas as pd
df=pd.read_csv('data.csv') 
# df.head()  # it prints the data from top
df.head(2)

    Name  Age    Address       Phone
0    Ram   25  Kathmandu  9854124536
1  Shyam   29    Pokhara  9874561265

In [8]:
import pandas as pd
df=pd.read_csv('data.csv')
df.tail(2)

   Name  Age Address       Phone
4  Rita   32   Gulmi  9865214578
5  Sita   19    Bara  9865235447

In [9]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  #it makes Sn as universal index
df

     Name  Age    Address       Phone
Sn
1     Ram   25  Kathmandu  9854124536
2   Shyam   29    Pokhara  9874561265
3    Hari   24     Butwal  9842153678
4    John   35      Kapan   981245785
5    Rita   32      Gulmi  9865214578
6    Sita   19       Bara  9865235447

In [10]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  #it makes Sn as universal index
df.iloc[0:5,0:3]  #it gives data on the basis of index range

     Name  Age    Address
Sn
1     Ram   25  Kathmandu
2   Shyam   29    Pokhara
3    Hari   24     Butwal
4    John   35      Kapan
5    Rita   32      Gulmi

In [11]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  
df.loc[2:5]

     Name  Age  Address       Phone
Sn
2   Shyam   29  Pokhara  9874561265
3    Hari   24   Butwal  9842153678
4    John   35    Kapan   981245785
5    Rita   32    Gulmi  9865214578

In [13]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Name')  
df['Shyam':'Rita']

       Sn  Age  Address       Phone
Name
Shyam   2   29  Pokhara  9874561265
Hari    3   24   Butwal  9842153678
John    4   35    Kapan   981245785
Rita    5   32    Gulmi  9865214578

In [14]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Name')  
df.loc['Shyam':'Rita']      #if there is data repetition then we can use only df but we need df.loc for repetition

       Sn  Age  Address       Phone
Name
Shyam   2   29  Pokhara  9874561265
Hari    3   24   Butwal  9842153678
John    4   35    Kapan   981245785
Rita    5   32    Gulmi  9865214578

In [15]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  
df['Age']

Sn
1    25
2    29
3    24
4    35
5    32
6    19
Name: Age, dtype: int64

In [16]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  
df['Age']>60

Sn
1    False
2    False
3    False
4    False
5    False
6    False
Name: Age, dtype: bool

In [18]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  
df[df['Age']>30]

    Name  Age Address       Phone
Sn
4   John   35   Kapan   981245785
5   Rita   32   Gulmi  9865214578

In [19]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  
df[df['Address']=='Kathmandu']

   Name  Age    Address       Phone
Sn
1   Ram   25  Kathmandu  9854124536

In [20]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn',usecols=['Sn','Name'])  
df

     Name
Sn
1     Ram
2   Shyam
3    Hari
4    John
5    Rita
6    Sita

In [21]:
import pandas as pd
df=pd.read_csv('data.csv',usecols=['Address','Name'])  
df

    Name    Address
0    Ram  Kathmandu
1  Shyam    Pokhara
2   Hari     Butwal
3   John      Kapan
4   Rita      Gulmi
5   Sita       Bara

In [22]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  
df1=df[df['Age']>20]
df1.to_csv('df1.csv')

In [44]:
import pandas as pd
df=pd.read_csv('data.csv',index_col='Sn')  
df1=df[(df['Age']>20) & (df['Address']=='Kathmandu')]
df1.to_csv('df1.csv')

In [41]:
import csv
fields=[7,'Hari',78,'Kathmandu',9845123657,'\n']
f=open('data.csv','a')
x=csv.writer(f)
x.writerow(fields)
f.close()

In [36]:
a=[['Name','Price','Qty','Total'],['Apple', 100, 2, 200], ['Banana', 200, 3, 600], ['milk', 100, 3, 300]]
import csv
f=open('data2.csv','a')
x=csv.writer(f)
for i in a:
    x.writerow(i)
f.close()

In [3]:
# DictWriter()
# Dataframe()
import pandas as pd
a=pd.read_excel('sample1.xlsx')
a

     Postcode  Sales_Rep_ID Sales_Rep_Name  Year         Value
0        2121           456           Jane  2011  84219.497311
1        2092           789         Ashish  2012  28322.192268
2        2128           456           Jane  2013  81878.997241
3        2073           123           John  2011  44491.142121
4        2134           789         Ashish  2012  71837.720959
..        ...           ...            ...   ...           ...
385      2164           123           John  2012  88884.535217
386      2193           456           Jane  2013  79440.290813
387      2031           123           John  2011  65643.689454
388      2130           456           Jane  2012  66247.874869
389      2116           456           Jane  2013   3195.699054

[390 rows x 5 columns]

In [13]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile

df = pd.read_excel('sample1.xlsx',nrows=25)

print("Column headings:")
print(df)

Column headings:
    Postcode  Sales_Rep_ID Sales_Rep_Name  Year         Value
0       2121           456           Jane  2011  84219.497311
1       2092           789         Ashish  2012  28322.192268
2       2128           456           Jane  2013  81878.997241
3       2073           123           John  2011  44491.142121
4       2134           789         Ashish  2012  71837.720959
5       2162           123           John  2013  64531.549254
6       2093           456           Jane  2011  58962.639832
7       2042           789         Ashish  2012  27521.791964
8       2198           123           John  2013  77985.126101
9       2043           789         Ashish  2011  49546.123317
10      2025           789         Ashish  2012  17733.774600
11      2045           456           Jane  2013  91125.995923
12      2090           456           Jane  2011  48112.764779
13      2114           456           Jane  2012  28361.338391
14      2142           456           Jane  2013  50911.554905
15      2062           123           John  2011  75538.869741
16      2049           456           Jane  2012  96922.328345
17      2204           456           Jane  2013  57838.175024
18      2000           456           Jane  2011   4529.748564
19      2135           123           John  2012  27761.119322
20      2115           456           Jane  2013  22772.698378
21      2032           789         Ashish  2011  98780.162874
22      2068           456           Jane  2012  66043.702356
23      2119           789         Ashish  2013  32882.274839
24      2060           456           Jane  2011  75822.406617